<html xmlns:ng="http://docbook.org/docbook-ng"><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Snake Game DocBook Support</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>Snake Game DocBook Support</h1></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="sect1"><a href="#d5e4">&#1050;&#1088;&#1072;&#1090;&#1082;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1080;&#1075;&#1088;&#1099;</a></span></dt><dt><span class="sect1"><a href="#d5e12">&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; </a></span></dt><dt><span class="sect1"><a href="#d5e16">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1082;&#1086;&#1076;&#1072;</a></span></dt></dl></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e4"></a>&#1050;&#1088;&#1072;&#1090;&#1082;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1080;&#1075;&#1088;&#1099;</h2></div></div></div><p><span class="bold"><strong>Snake</strong></span> (<span class="bold"><strong>&#1055;&#1080;&#1090;&#1086;&#1085;</strong></span>,
                <span class="bold"><strong>&#1059;&#1076;&#1072;&#1074;</strong></span>, <span class="bold"><strong>&#1047;&#1084;&#1077;&#1081;&#1082;&#1072;</strong></span> &#1080;
            &#1076;&#1088;.) &#8212; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1085;&#1072;&#1103; &#1080;&#1075;&#1088;&#1072; , &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1096;&#1072;&#1103; &#1074; &#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; &#1080;&#1083;&#1080; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; 1970-&#1093;.</p><p>&#1048;&#1075;&#1088;&#1086;&#1082; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1084;, &#1090;&#1086;&#1085;&#1082;&#1080;&#1084; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084;, &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1084; &#1079;&#1084;&#1077;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1083;&#1079;&#1072;&#1077;&#1090; &#1087;&#1086;
            &#1087;&#1083;&#1086;&#1089;&#1082;&#1086;&#1089;&#1090;&#1080; (&#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1077;&#1085;&#1082;&#1072;&#1084;&#1080;), &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1103; &#1077;&#1076;&#1091; (&#1080;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1084;&#1077;&#1090;&#1099;),
            &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1103; &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1103; &#1089; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1093;&#1074;&#1086;&#1089;&#1090;&#1086;&#1084; &#1080; &#1082;&#1088;&#1072;&#1103;&#1084;&#1080; &#1080;&#1075;&#1088;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072;
            &#1079;&#1084;&#1077;&#1103; &#1089;&#1098;&#1077;&#1076;&#1072;&#1077;&#1090; &#1082;&#1091;&#1089;&#1086;&#1082; &#1087;&#1080;&#1097;&#1080;, &#1086;&#1085;&#1072; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1076;&#1083;&#1080;&#1085;&#1085;&#1077;&#1077;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1085;&#1086; &#1091;&#1089;&#1083;&#1086;&#1078;&#1085;&#1103;&#1077;&#1090; &#1080;&#1075;&#1088;&#1091;. &#1048;&#1075;&#1088;&#1086;&#1082;
            &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1075;&#1086;&#1083;&#1086;&#1074;&#1099; &#1079;&#1084;&#1077;&#1080; (4 &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;: &#1074;&#1074;&#1077;&#1088;&#1093;, &#1074;&#1085;&#1080;&#1079;, &#1074;&#1083;&#1077;&#1074;&#1086;, &#1074;&#1087;&#1088;&#1072;&#1074;&#1086;),
            &#1072; &#1093;&#1074;&#1086;&#1089;&#1090; &#1079;&#1084;&#1077;&#1080; &#1076;&#1074;&#1080;&#1078;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1086;&#1084;. &#1048;&#1075;&#1088;&#1086;&#1082; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077; &#1079;&#1084;&#1077;&#1080;.</p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e12"></a>&#1051;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1103; </h2></div></div></div><p><span class="bold"><strong>GNU General Public License</strong></span></p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e16"></a>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1082;&#1086;&#1076;&#1072;</h2></div></div></div><p>&#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1076;&#1074;&#1072; &#1072;&#1088;&#1091;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; head - &#1075;&#1086;&#1083;&#1086;&#1074;&#1072; &#1079;&#1084;&#1077;&#1080; &#1080; arr - &#1090;&#1077;&#1083;&#1086; &#1079;&#1084;&#1077;&#1080;, &#1077;&#1089;&#1083;&#1080;
            &#1075;&#1086;&#1083;&#1086;&#1074;&#1072; &#1087;&#1088;&#1080; &#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1085;&#1072;&#1090;&#1099;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1100; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1090;&#1077;&#1083;&#1072;, &#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090; &#1101;&#1090;&#1086;
            &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;.</p><p>function eatTail(head, arr) {</p><p> for(let i = 0; i &lt; arr.length; i++) {</p><p> if(head.x == arr[i].x &amp;&amp; head.y == arr[i].y)</p><p> clearInterval(game);</p><p> }</p><p>}</p><p>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090; &#1085;&#1072; &#1082;&#1072;&#1082;&#1091;&#1102; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; &#1085;&#1072;&#1078;&#1072;&#1083; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;</p><p>function direction(event) {</p><p> if(event.keyCode == 37 &amp;&amp; dir != "right")</p><p> dir = "left";</p><p> else if(event.keyCode == 38 &amp;&amp; dir != "down")</p><p> dir = "up";</p><p> else if(event.keyCode == 39 &amp;&amp; dir != "left")</p><p> dir = "right";</p><p> else if(event.keyCode == 40 &amp;&amp; dir != "up")</p><p> dir = "down";</p><p>}</p><p>&#1061;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &lt;canvas&gt; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; canvas.</p><p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; ctx &#1076;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; 2D &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#8212; &#1084;&#1077;&#1090;&#1086;&#1076;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080; &#1074; Canvas.</p><p>const canvas = document.getElementById("game");</p><p>const ctx = canvas.getContext("2d");</p></div></div></body></html>
